Repository: pingfangx/TranslatorX-other
Catalog: AndroidDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Measure the view and its content to determine the measured width and the measured height.
zh_cn: 测量该 view 及它的内容以确定 measured width 和 measured height。

source: MeasureSpecs are used to push requirements down the tree from parent to child.
zh_cn: MeasureSpecs 用来把要求从 view 树中的父 view 传给子 view。

source: MediaController will hide and show the buttons according to these rules:
zh_cn: MediaController 将根据以下规则隐藏和显示按钮：

source: Menu items can also be used for programmatically selecting which destination is currently active.
zh_cn: 菜单项也可用于以编程方式选择当前活动的目的地。

source: Method tracing
zh_cn: 方法跟踪

source: Methods
zh_cn: 方法

source: Methods that return or receive *LayoutPosition* use position as of the latest layout calculation (e.g. RecyclerView.ViewHolder.getLayoutPosition(), findViewHolderForLayoutPosition(int)).
zh_cn: 返回或接收 *LayoutPosition* 的方法使用最新布局计算的位置(例如 RecyclerView.ViewHolder.getLayoutPosition()，findViewHolderForLayoutPosition(int))。

source: Methods that return or receive *LayoutPosition* use position as of the latest layout calculation (e.g. getLayoutPosition(), findViewHolderForLayoutPosition(int)).
zh_cn: 返回或接收布局位置(*LayoutPosition*)的方法，使用的位置是最近的布局计算位置。(比如 getLayoutPosition(), findViewHolderForLayoutPosition(int))。

source: Millimeters - Based on the physical size of the screen.
zh_cn: Millimeters（毫米） - 基于屏幕的物理尺寸。

source: Minimize resource use from libraries
zh_cn: 最大限度地减少库中的资源使用

source: Minimum curve angle a stroke must contain before it is recognized as a gesture.
zh_cn: 在将笔划识别为手势之前，笔划必须包含的最小曲线角度。

source: Minimum dimensions on ConstraintLayout
zh_cn: ConstraintLayout 上的最小尺寸

source: Minimum inset for content views within a bar when a navigation button is present, such as the Up button.
zh_cn: 存在导航按钮时，例如“向上”按钮，bar 内内容 view 的最小内缩位置。

source: Minimum inset for content views within a bar when actions from a menu are present.
zh_cn: 当菜单中的操作存在时，栏内内容 view 的最小内缩。

source: Minimum inset for content views within a bar.
zh_cn: bar 中内容 view 的最小内缩。

source: Minimum length of a stroke before it is recognized as a gesture.
zh_cn: 在将笔划识别为手势之前的最小笔画长度。

source: Minimum space between the switch and caption text.
zh_cn: 开关和标题文本之间的最小间距。

source: Minimum width for the switch component.
zh_cn: 开关组件的最小宽度。

source: Modern touch UIs define interactions in terms of gestures such as tapping, pulling, pushing, flinging, and zooming.
zh_cn: 现代触摸 UI 定义了手势方面的交互，例如点击，拉动，推动，投掷和缩放。

source: Modify the image after decoding and scaling.
zh_cn: 解码和缩放后修改图像。

source: Modifying an Existing View Type
zh_cn: 修改一个已存在的 View 类型

source: More Information
zh_cn: 更多信息

source: More Resource Types
zh_cn: 更多资源类型

source: More information about a successful match can be obtained by querying the state of the matcher.
zh_cn: 通过查询匹配器的状态可以获取关于成功匹配的更多信息。

source: Most callers will want to use the defaults, though, which will be appropriate for the user's locale.
zh_cn: 但是，大多数调用者都希望使用默认值，这些默认值适用于用户的语言环境。

source: Most calls to onDraw() are the result of a call to invalidate(), so eliminate unnecessary calls to invalidate().
zh_cn: 大多数对 onDraw() 的调用是对 invalidate() 的调用的结果，因此应消除对 invalidate() 的不必要调用。

source: Most of the time, this is a case where the transient state will be cleared in #onBindViewHolder(ViewHolder, int) call when View is rebound to a new position.
zh_cn: 大多数情况下，当 View 重新绑定到新位置时，在 #onBindViewHolder(ViewHolder, int) 调用中将清除 transient 状态。

source: Most often, you do this by calling setResult().
zh_cn: 通常，通过调用 setResult() 来完成此操作。

source: Most used properties can be then obtained from getProperties(Context, AttributeSet, int, int).
zh_cn: 最常用的属性可以从 getProperties(Context, AttributeSet, int, int) 中获得。

source: Most views pass the Scroller object's x and y position directly to scrollTo().
zh_cn: 大多数 view 将 Scroller 对象的 x 和 y 位置直接传递给 scrollTo()。

source: Motions begin and end smoothly instead of starting and stopping abruptly.
zh_cn: 动作开始和结束平滑地而不是突然开始和停止。

source: Move all resource initialization so that the app can perform it lazily on a different thread.
zh_cn: 移动所有资源初始化，以便应用程序可以在另一个线程上懒惰地执行它。

source: Move the scrolled position of your view.
zh_cn: 移动该 view 的滚动位置。

source: Multiple components in the same row or column group are considered to act in parallel.
zh_cn: 同一行或列组中的多个组件被视为在 parallel (并行) 中起作用。

source: Multiple groups
zh_cn: 多个组

source: Multiple groups can reference the same widgets -- in that case, the XML declaration order will define the final visibility state (the group declared last will have the last word).
zh_cn: 多个组可以引用相同的小部件 - 在这种情况下，XML 声明顺序将定义最终的可见性状态(最后声明的组说了算)。

source: Multiplies or screens the source and destination depending on the destination color.
zh_cn: 取决于目标颜色，将源与目标相乘或屏蔽。

source: Multiplies the source and destination pixels.
zh_cn: 将源像素和目标像素相乘。

source: Must be greater than or equal to 1.
zh_cn: 必须大于或等于 1。

source: Must be non-null.
zh_cn: 必须为非 null。

source: Must be one or more (separated by '|') of the following constant values.
zh_cn: 必须是以下常量值中的一个或多个(由“|”分隔)。

source: Mutable Bitmaps are also incompatible with decodeDrawable, which would require retrieving the Bitmap from the returned Drawable in order to modify.
zh_cn: 可变位图也与 decodeDrawable 不兼容，这需要从返回的 Drawable 中检索位图才能进行修改。

source: Mutable Bitmaps are incompatible with ALLOCATOR_HARDWARE, because Bitmap.Config.HARDWARE Bitmaps cannot be mutable.
zh_cn: 可变位图与 ALLOCATOR_HARDWARE 不兼容，因为 Bitmap.Config.HARDWARE 位图不能是可变的。

source: NOT intended as a replacement for BitmapRegionDecoder.decodeRegion().
zh_cn: 不打算替代 BitmapRegionDecoder.decodeRegion()。

source: NOTE: A view can fail to be recycled when it is scrolled off while an animation runs.
zh_cn: 注意：当动画运行时，view 被滚动关闭时，可能无法回收。

source: NOTE: other methods on View should not call this method directly, but performClickInternal() instead, to guarantee that the autofill manager is notified when necessary (as subclasses could extend this method without calling super.performClick()).
zh_cn: 注意：view 上的其他方法不应直接调用此方法，而应调用 performClickInternal()，以确保在必要时通知自动填充管理器(因为子类可以扩展此方法而不调用 super.performClick())。

source: Name of the method in this View's context to invoke when the view is clicked.
zh_cn: 单击 view 时要调用的此 View 上下文中方法的名称。

source: Names a View such that it can be identified for Transitions.
zh_cn: 命名一个 view，以便可以为 Transitions 标识它。

source: NavigationView is typically placed inside a DrawerLayout.
zh_cn: NavigationView 通常放在 DrawerLayout 中。

source: Nearly every local variable declaration should contain an initializer.
zh_cn: 几乎每个局部变量声明都应该包含一个初始化程序。

source: Nested classes
zh_cn: 嵌套类

source: Nested scrolling is enabled by default.
zh_cn: 默认情况下启用嵌套滚动。

source: NestedScrollView is just like ScrollView, but it supports acting as both a nested scrolling parent and child on both new and old versions of Android.
zh_cn: NestedScrollView 就像 ScrollView，但它支持在新旧版本的 Android 上充当嵌套滚动 parent 和 child。

source: Never add a RecyclerView or ListView to a scroll view.
zh_cn: 切勿将 RecyclerView 或 ListView 添加到滚动 view 中。

source: Never allow a user to over-scroll this view.
zh_cn: 绝不允许用户过度滚动此 view。

source: Never make an allocation while an animation is running.
zh_cn: 永远不要在动画运行时进行分配。

source: New position of the item.
zh_cn: 项目的新位置。

source: Next, call the method Intent.setFlags() with either FLAG_GRANT_READ_URI_PERMISSION or FLAG_GRANT_WRITE_URI_PERMISSION or both.
zh_cn: 接下来，调用方法 Intent.setFlags() ，使用 FLAG_GRANT_READ_URI_PERMISSION 或 FLAG_GRANT_WRITE_URI_PERMISSION 或两者。

source: Next, it discusses how to profile startup performance.
zh_cn: 接下来，它将讨论如何分析启动性能。

source: No attributes.
zh_cn: 没有属性。

source: No color information is stored.
zh_cn: 没有存储颜色信息。

source: No lexical check is done on the content of a CDATA section and it is therefore possible to have the character sequence "]]>" in the content, which is illegal in a CDATA section per section 2.7 of [XML 1.0].
zh_cn: 没有对 CDATA 部分的内容进行词汇检查，因此内容中可能包含字符序列 "]]>"，这在 CDATA 部分的每个部分 2.7 中是非法的[ XML 1.0]。

source: No longer supported.
zh_cn: 不再支持。

source: No touch targets so treat this as an ordinary view.
zh_cn: 没有触摸目标，因此把它当作一个普通 view。

source: No-op stubs for SlidingPaneLayout.PanelSlideListener.
zh_cn: SlidingPaneLayout.PanelSlideListener 的无操作存根。

source: Non-public, non-static field names start with m.
zh_cn: 非公开且非静态字段的名称以 m 开头。

source: Normal list that does not indicate choices
zh_cn: 正常列表，不表示选择

source: Not all adapters may support all change types and some may fall back to a generic RecyclerView.AdapterDataObserver#onChanged() "something changed" event if more specific data is not available.
zh_cn: 并非所有适配器都支持所有更改类型，如果没有更具体的数据，有些适配器可能会返回到通用的 RecyclerView.AdapterDataObserver#onChanged() "something changed" 事件。

source: Not inflating parts of the UI that do not need to be visible during launch.
zh_cn: 不加载在启动期间不需要显示的 UI 部分内容。

source: Not inside a scrolling container, so show the feedback right away
zh_cn: 不在滚动容器中，所以立即显示反馈

source: Note also that the inner class we defined is referenced using the NoteEditor$LinedEditText notation which is a standard way to refer to inner classes in the Java programming language.
zh_cn: 另请注意，我们定义的内部类是使用 NoteEditor$LinedEditText 表示法引用的，这是一种在 Java 编程语言中引用内部类的标准方法。

source: Note also that the inner class we defined is referenced using the NoteEditor$MyEditText notation which is a standard way to refer to inner classes in the Java programming language.
zh_cn: 同时要注意，我们是通过一个$符号来引用我们定义的的内部类的 NoteEditor$MyEditText，这是 Java 编程语言中标准的引用内部类的方法。

source: Note also that unlike most collections' indexOf methods, this method compares values using == rather than equals.
zh_cn: 还要注意，与大多数集合的indexOf 方法不同，此方法使用 == 而不是 equals 来比较值。

source: Note that "-1" means "unset".
zh_cn: 注意 "-1" 意味着 "unset" 。

source: Note that TypedArray objects are a shared resource and must be recycled after use.
zh_cn: 请注意，TypedArray 对象是共享资源，必须在使用后回收。

source: Note that a margin can only be positive or equals to zero, and takes a Dimension.
zh_cn: 注意：margin 只能大于等于 0，并且带 Dimension。（译注：在线性布局和相对布局中，margin 是可以为负的）。

source: Note that changing the window fullscreen flag will never provide a stable layout for a clean transition.
zh_cn: 请注意，更改窗口全屏标志永远不会为清洁过渡提供稳定的布局。

source: Note that fail-fast behavior cannot be guaranteed as it is, generally speaking, impossible to make any hard guarantees in the presence of unsynchronized concurrent modification.
zh_cn: 注意，迭代器的快速失败行为无法得到保证，因为一般来说，不可能对是否出现不同步并发修改做出任何硬性保证。

source: Note that if this method returns true, RecyclerView will ignore the transient state of the View and recycle it regardless.
zh_cn: 请注意，如果此方法返回 true，则 RecyclerView 将忽略 View 的瞬态并将其回收。

source: Note that if you are providing your own implementation of fitSystemWindows(Rect), then there is no need to set this flag to true -- your implementation will be overriding the default implementation that checks this flag.
zh_cn: 请注意，如果你提供自己的 fitSystemWindows(Rect) 的实现，则无需将此标志设置为 true - 你的实现将重写检查这个标志的默认实现。

source: Note that if you customize these strings, it is your responsibility to supply strings appropriate for formatting dates and/or times in the user's locale.
zh_cn: 请注意，如果你自定义这些字符串，则你有责任提供适合格式化用户区域设置中的日期和/或时间的字符串。

source: Note that it is possible to add your own parameters as well, and we will touch on this again below.
zh_cn: 注意，你也可以添加自己的参数，我们将在后面再讨论。

source: Note that just like with an Activity, you can use either the declarative (XML-based) approach to creating the contained components, or you can nest them programmatically from your code.
zh_cn: 注意，就像 Activity 一样，你既可以用申明的方式来创建这种容器组件(基于 XML)，也可以在代码中用编程的方式嵌套它们。

source: Note that properties that are known at build time can be set in the XML layout files.
zh_cn: 注意在构建时可知的属性可以设置到 XML 文件中。

source: Note that some flags must be set before the window decoration is created (by the first call to setContentView(View, android.view.ViewGroup.LayoutParams) or getDecorView(): WindowManager.LayoutParams.FLAG_LAYOUT_IN_SCREEN and WindowManager.LayoutParams.FLAG_LAYOUT_INSET_DECOR.
zh_cn: 请注意，一些标志必须在创建窗口修饰之前设置（创建窗口可通过第一次调用 setContentView(View, android.view.ViewGroup.LayoutParams) 或 getDecorView()：WindowManager.LayoutParams.FLAG_LAYOUT_IN_SCREEN 和 WindowManager.LayoutParams.FLAG_LAYOUT_INSET_DECOR。

source: Note that some groups, for example (a*), match the empty string.
zh_cn: 注意，某些组，比如 (a*) 匹配空字符串。

source: Note that some patterns, for example a*, match the empty string.
zh_cn: 注意，某些模式，比如 a* 匹配空字符串。

source: Note that span offsets always start with 0 and are not affected by RTL.
zh_cn: 注意 span 偏移总是从 0 开始的，并且不受 RTL 影响。

source: Note that the array is not required to be homogeneous, so you can create an array of mixed resource types, but you must be aware of what and where the data types are in the array so that you can properly obtain each item with the TypedArray's get...() methods.
zh_cn: 请注意，数组不需要是同类的，因此你可以创建混合资源类型的数组，但是你必须知道数组中数据类型的位置和位置，以便你可以使用 TypedArray 的 get...() 方法正确获取每个项目。

source: Note that the output color space is not guaranteed to be the color space the bitmap is encoded with.
zh_cn: 请注意，输出颜色空间不能保证是位图编码的颜色空间。

source: Note that the width and height are set to "wrap_content" to make the button fit neatly around the text.
zh_cn: 注意宽度和高度是设置为了 "wrap_content" 以使按钮整齐地包围文字。

source: Note that this may contain characters that need to be escaped outside of CDATA sections and that, depending on the character encoding ("charset") chosen for serialization, it may be impossible to write out some characters as part of a CDATA section.
zh_cn: 请注意，可能 包含需要在 CDATA 部分之外转义的字符，并且根据为序列化选择的字符编码("charset")，可能无法将某些字符写为 CDATA 部分的一部分。

source: Note that this container keeps its mappings in an array data structure, using a binary search to find keys.
zh_cn: 注意，这个容器将其映射保存在一个数组数据结构中，使用二分搜索来查找键。

source: Note that this exception does not always indicate that an object has been concurrently modified by a different thread.
zh_cn: 注意，此异常不会始终指出对象已经由 different 线程并发修改。

source: Note that this implementation is not intended to be appropriate for data structures that may contain large numbers of items.
zh_cn: 请注意，此实现不适用于可能包含大量项的数据结构。

source: Note that this will be non-null slightly before getActivity(), during the time from when the fragment is placed in a FragmentTransaction until it is committed and attached to its activity.
zh_cn: 注意：它将在 getActivity() 的稍之前是非空的，从 fragment 被放于 FragmentTransaction 中到它被提交并附加到它的 activity 之间这段时间。(译注：我也不知道啥意思)。

source: Note that unlike android.widget.ListView, RecyclerView will not call this method again if the position of the item changes in the data set unless the item itself is invalidated or the new position cannot be determined.
zh_cn: 请注意，与 android.widget.ListView 不同，如果项在数据集中的位置发生更改，RecyclerView 将不会再次调用此方法，除非项本身无效或无法确定新位置。

source: Note that when all animations are created by RecyclerView.ItemAnimator, you should never receive this callback because RecyclerView keeps those Views as children until their animations are complete.
zh_cn: 请注意，当所有动画都由 RecyclerView.ItemAnimator 创建时，你不应该收到此回调，因为 RecyclerView 将这些 view 保留为子 view，直到它们的动画完成为止。

source: Note that you also might introduce your own attributes and parameters into the XML that can be pulled out and used by your constructor.
zh_cn: 注意，你也可以在 XML 文件中引入一些自己的属性和参数，然后在构造方法中取出来使用。

source: Note that you cannot have a circular dependency between the size of the RelativeLayout and the position of its children.
zh_cn: 请注意，RelativeLayout 的大小与其子项的位置之间不能存在循环依赖关系。

source: Note that you cannot have a circular dependency in constraints.
zh_cn: 请注意，你不能在约束中具有循环依赖关系。

source: Note that, Recycler never sends Views to this method to be cached.
zh_cn: 请注意，Recycler 从不将 view 发送到此方法来进行缓存。

source: Note that, if you specify exact dimensions for the CardView, because of the shadows, its content area will be different between platforms before Lollipop and after Lollipop.
zh_cn: 请注意，如果你为 CardView 指定精确尺寸，由于阴影，其内容区域在 Lollipop 之前和 Lollipop 之后的平台之间会有所不同。

source: Note the order: we must call endAnimation() after recycleViewHolderInternal() to avoid recycle twice.
zh_cn: 注意顺序：我们必须在 recycleViewHolderInternal() 之后调用 endAnimation()，以避免回收两次。

source: Note, however, that some code conversion libraries at the time of writing do not return an error or exception when a character is missing from the encoding, making the task of ensuring that data is not corrupted on serialization more difficult.
zh_cn: 但请注意，编写时某些代码转换库在编码中缺少某个字符时不会返回错误或异常，因此确保数据在序列化时不会损坏的任务更加困难。

source: Note, many examples use ListActivity or ListFragment to display a list view.
zh_cn: 注意，许多示例使用 ListActivity 或 ListFragment 来显示列表 view。

source: Note: If this Source is passed to decodeDrawable, and the encoded image is animated, the returned AnimatedImageDrawable will continue reading from the buffer, so its contents must not be modified, even after the AnimatedImageDrawable is returned.
zh_cn: 注意：如果将 Source 传递给 decodeDrawable，并对编码图像进行动画处理，则返回 AnimatedImageDrawable 将继续从 buffer 读取，因此即使在返回 AnimatedImageDrawable 之后也不得修改其内容。

source: Note: Styling must applied to each child button individually.
zh_cn: 注意：样式必须单独应用于每个子按钮。

source: Note: The Android framework is responsible for measuring, laying out and drawing views.
zh_cn: 注：安卓框架负责测量、布局和绘制 view。

source: Note: The Material Design Guidelines caution against using an ExtendedFloatingActionButton with a BottomAppBar, so there is limited support for that use case.
zh_cn: 注意：“材料设计指南”提醒不要将 ExtendedFloatingActionButton 与 BottomAppBar 一起使用，因此对此的支持有限用例。

source: Note: as of KITKAT, any bitmap created with this configuration will be created using ARGB_8888 instead.
zh_cn: 注意：从 KITKAT 中，使用此配置创建的任何位图都将使用 ARGB_8888 创建。

source: Note: not all Formats support all bitmap configs directly, so it is possible that the returned bitmap from BitmapFactory could be in a different bitdepth, and/or may have lost per-pixel alpha (e.g. JPEG only supports opaque pixels).
zh_cn: 注意：并非所有格式都直接支持所有位图配置，因此 BitmapFactory 返回的位图可能处于不同的位深度，并且/或者可能每像素阿尔法值丢失(例如 JPEG 仅支持不透明像素)。

source: Note: the decoder uses a final value based on powers of 2, any other value will be rounded down to the nearest power of 2.
zh_cn: 注意：解码器使用基于 2 的幂的最终值，任何其他值将向下舍入到最接近的 2 的幂。

source: Notes:
zh_cn: 注意事项：

source: Notice how the width and height of the button varies with the text, and the background image stretches to accommodate it.
zh_cn: 注意不管按钮的宽高因文字如何变，变景图片总能缩放以适应它。

source: Notice how there are no actual permission names listed in the annotation.
zh_cn: 注意没有实际的权限名称在注解中列出来。

source: Notice that setShowText calls invalidate() and requestLayout().
zh_cn: 请注意，setShowText 调用 invalidate() 和 requestLayout()。

source: Notice that the MyEditText class is now a separate class file.
zh_cn: 注意此时的 MyEditText 类是一个独立的类文件。

source: Notice that the android:id value does not include the plus sign in the ID reference, because the ID already exists, as defined in the ids.xml example above.
zh_cn: 请注意，android:id 值不包含 ID 引用中的加号，因为 ID 已存在，如上面的 ids.xml 示例中所定义。

source: Notice that the value refers to a subdirectory, not an individual file or files.
zh_cn: 请注意，该值是指 subdirectory，而不是单个文件或文件。

source: Notice the name of the XML tag that adds the custom view to the layout.
zh_cn: 请注意将自定义 view 添加到布局的 XML 标记的名称。

source: Notify any registered observers that the itemCount items previously located at positionStart have been removed from the data set.
zh_cn: 通知所有注册的观察者先前位于 positionStart 的 itemCount 个项已从数据集中移除。

source: Notify any registered observers that the itemCount items starting at position positionStart have changed.
zh_cn: 通知所有注册观察者 itemCount 个项，从 positionStart 已更改。

source: Notify any registered observers that the currently reflected itemCount items starting at positionStart have been newly inserted.
zh_cn: 通知所有注册的观察者，从 positionStart 开始的当前反射的 itemCount 个项目已被新插入。

source: Notify any registered observers that the data set has changed.
zh_cn: 通知所有注册的观察者数据集已更改。

source: Notify any registered observers that the item at position has changed with an optional payload object.
zh_cn: 通知所有注册的观察者 position 处的项目已更改，带有可选的有效载荷对象。

source: Notify any registered observers that the item at position has changed.
zh_cn: 通知所有注册观察者 position 处的项目已更改。

source: Notify any registered observers that the item previously located at position has been removed from the data set.
zh_cn: 通知所有注册观察者先前位于 position 处的项目已从数据集中移除。

source: Notify any registered observers that the item reflected at fromPosition has been moved to toPosition.
zh_cn: 通知所有注册观察者，fromPosition 反射的项目已移动到 toPosition。

source: Notify any registered observers that the item reflected at position has been newly inserted.
zh_cn: 通知所有注册观察者 position 处反映的项目已被新插入。

source: Notify the scroller that we've reached a horizontal boundary.
zh_cn: 通知滚动器我们已到达水平边界。

source: Notify the scroller that we've reached a vertical boundary.
zh_cn: 通知滚动器我们已到达垂直边界。

source: Now that you have a well-designed view that responds to gestures and transitions between states, ensure that the view runs fast.
zh_cn: 既然你有一个精心设计的 view 来响应手势和状态之间的转换，请确保 view 快速运行。

source: Now the entire size is dictated by the height of the view (which can be defined in any way) as shown in figure 11.
zh_cn: 现在整个尺寸由 view 的高度(其可以以任何方式定义)来决定，如图 11 所示。

source: Now you're ready to build your layout with ConstraintLayout.
zh_cn: 现在你已经准备好用 ConstraintLayout 来构建布局了。

source: Null indicates 'normal' 1-to-1 scrolling.
zh_cn: Null 表示“正常”的 1 对 1 滚动。

source: Number of items inserted
zh_cn: 插入的项目数

source: Number of items removed from the data set
zh_cn: 从数据集中移除的项目数

source: Number of items that have changed
zh_cn: 已更改的项目数

source: Objects should always act in the same way that real objects do.
zh_cn: 对象应始终以与真实对象相同的方式起作用。

source: Observer base class for watching changes to an RecyclerView.Adapter.
zh_cn: Observer 基类，观看 RecyclerView.Adapter 的变化。

source: Observer to register
zh_cn: 要注册的观察者

source: Observer to unregister
zh_cn: 要注销的观察者

source: Offset the bounds of all child views by dx pixels.
zh_cn: 偏移所有的子 view 的边界通过指定的 dx 像素。

source: Offset the bounds of all child views by dy pixels.
zh_cn: 偏移所有子 view 的边界通过指定的 dy 像素。

source: Offset the path by (dx,dy)
zh_cn: 将路径偏移(dx,dy)

source: Often, there are opportunities to optimize this work to achieve performance improvements.
zh_cn: 通常，有机会优化这项工作以实现性能改进。

source: On a high density display, the default distance is 1920.
zh_cn: 在高密度显示器上，默认距离为 1920。

source: Once completed, your new extension class can be used in place of the view upon which it was based.
zh_cn: 一旦完成，你的新继承类就可以用来代替它的基类。

source: Once created, a matcher can be used to perform three different kinds of match operations:
zh_cn: 创建匹配器后，可以使用它执行三种不同的匹配操作：

source: Once the app process has completed the first draw, the system process swaps out the currently displayed background window, replacing it with the main activity.
zh_cn: 应用程序进程完成第一次绘制后，系统进程会交换当前显示的背景窗口，将其替换为主 activity。

source: Once the application supplies the URI for a specific TV channel to tune(String, Uri) method, it takes care of underlying service binding (and unbinding if the current TvView is already bound to a service) and automatically allocates/deallocates resources needed.
zh_cn: 一旦应用程序将特定电视频道的 URI 提供给 tune(String, Uri) 方法，它就会处理底层服务绑定(如果当前的 TvView 已经绑定到一个服务，则解除绑定)并自动分配/释放所需的资源。

source: Once the scrolling view has reached the end of it's scroll range, the remainder of this view will be scrolled into view.
zh_cn: 当滚动 view 到达滚动范围的末尾后，此 view 的其余部分将滚动到 view 中。

source: Once the width and height are calculated, the setMeasuredDimension(int width, int height) method must be called with the calculated measurements.
zh_cn: 一旦计算出了宽度和高度，必须用计算的结果调用 setMeasuredDimension(int width, int height) 方法。

source: Once visible, the progress bar will be visible for a minimum amount of time to avoid "flashes" in the UI when an event could take a largely variable time to complete (from none, to a user perceivable amount)
zh_cn: 一旦可见，进度条将在最短时间内可见，以避免在事件可能需要大量可变时间(从无到用户可感知的时间)完成时在用户界面中“闪烁”。

source: Once you define the custom attributes, you can use them in layout XML files just like built-in attributes.
zh_cn: 定义自定义属性后，可以像布局属性一样在布局 XML 文件中使用它们。
